def number_operations(n):
    if n<1 or n>100_000:
        print("Ошибка,число n должно принадлежать промежутку [1,100_000]")
        return -1
    # counter=0
    # while n>0:
    #     n-=3
    #     counter+=1
    # return counter     ---1 вариант
    counter=(n+2)//3 #если число целочисленно,делится на 3 ,то от +2 при //3 ничего не поменяется
                     #однако если есть какой-то остаток(который заставит сделать лишнюю операцию),
                     #то при +2 он добавит 1 к counter при //3(строгое деление(отбрасывает дробную часть числа))
    return counter

def main():
    n=int(input("Введите число n"))
    print(number_operations(n))


main()