def simple_number(n):
    if n <= 1:
        print(f"{n}-не простое число")   #отрицательные числа не являются простыми,1 и 0-также не являются простыми числами
        return -1
    if n > 25:
        print("Ошибка,диапозон значений n равен (1,25]")
        return -1
    for i in range(2,n): #начинаем проверку с 2,потому что при i=0 будет ошибка(деление на 0);при i=1 любое число делится на 1,это ничего не даст
        if n % i == 0:
            print(f"{n}-не простое")
            return -1
    print(f"{n}-простое число")
    return 1


def main():
    n = int(input("Введите n от 1 до 25"))
    simple_number(n)


main()
